   IDENTIFICATION DIVISION.
   PROGRAM-ID. TEA-ENCRYPT.
   ENVIRONMENT DIVISION.
   DATA DIVISION.
   WORKING-STORAGE SECTION.
   01  DELTA           PIC 9(8) VALUE 16#9E3779B9.
   01  KEY-ARRAY       PIC X(16).
   01  KEY-ARRAY-LEFT  PIC X(8).
   01  KEY-ARRAY-RIGHT PIC X(8).
   01  VECTOR-ARRAY    PIC X(16).
   01  VECTOR-ARRAY-LEFT  PIC X(8).
   01  VECTOR-ARRAY-RIGHT PIC X(8).
   01  ENCRYPTED-ARRAY PIC X(16).
   01  ENCRYPTED-ARRAY-LEFT  PIC X(8).
   01  ENCRYPTED-ARRAY-RIGHT PIC X(8).
   01  SUM             PIC 9(8) VALUE 0.
   01  ROUND           PIC 9(4) VALUE 32.
   01  COUNT           PIC 9(4).
   01  INDEX           PIC 9(4).
   01  LEFT-TEMP       PIC 9(4).
   01  RIGHT-TEMP      PIC 9(4).
   01  TEMP            PIC 9(8).
   PROCEDURE DIVISION.
   MAIN-PROCEDURE.
   PERFORM LOAD-KEY-ARRAY.
   PERFORM LOAD-VECTOR-ARRAY.
   PERFORM ENCRYPT-VECTOR.
   PERFORM STORE-ENCRYPTED-ARRAY.
   GOBACK.
   LOAD-KEY-ARRAY.
   ACCEPT KEY-ARRAY.
   MOVE KEY-ARRAY(1:8) TO KEY-ARRAY-LEFT.
   MOVE KEY-ARRAY(9:16) TO KEY-ARRAY-RIGHT.
   GOBACK.
   LOAD-VECTOR-ARRAY.
   ACCEPT VECTOR-ARRAY.
   MOVE VECTOR-ARRAY(1:8) TO VECTOR-ARRAY-LEFT.
   MOVE VECTOR-ARRAY(9:16) TO VECTOR-ARRAY-RIGHT.
   GOBACK.
   ENCRYPT-VECTOR.
   MOVE VECTOR-ARRAY-LEFT  TO LEFT-TEMP.
   MOVE VECTOR-ARRAY-RIGHT TO RIGHT-TEMP.
   SET COUNT TO 0.
   PERFORM ENCRYPT-LOOP UNTIL COUNT EQUALS ROUND.
   GOBACK.
   ENCRYPT-LOOP.
   ADD DELTA TO SUM.
   MOVE SUM TO TEMP.
   COMPUTE INDEX = (TEMP / 16#100000000) MOD 32.
   MOVE KEY-ARRAY-LEFT(INDEX:INDEX+1) TO TEMP.
   COMPUTE LEFT-TEMP = LEFT-TEMP + TEMP.
   COMPUTE INDEX = (TEMP / 16#10000) MOD 32.
   MOVE KEY-ARRAY-RIGHT(INDEX:INDEX+1) TO TEMP.
   COMPUTE RIGHT-TEMP = RIGHT-TEMP + TEMP.
   COMPUTE TEMP = LEFT-TEMP + RIGHT-TEMP.
   COMPUTE LEFT-TEMP = LEFT-TEMP XOR TEMP.
   COMPUTE RIGHT-TEMP = RIGHT-TEMP XOR TEMP.
   COMPUTE LEFT-TEMP = LEFT-TEMP XOR (TEMP / 16#100000000).
   COMPUTE RIGHT-TEMP = RIGHT-TEMP XOR (TEMP / 16#1000000).
   ADD 1 TO COUNT.
   GOBACK.
   STORE-ENCRYPTED-ARRAY.
   MOVE LEFT-TEMP  TO ENCRYPTED-ARRAY-LEFT.
   MOVE RIGHT-TEMP TO ENCRYPTED-ARRAY-RIGHT.
   MOVE ENCRYPTED-ARRAY-LEFT  TO ENCRYPTED-ARRAY(1:8).
   MOVE ENCRYPTED-ARRAY-RIGHT TO ENCRYPTED-ARRAY(9:16).
   DISPLAY "ENCRYPTED ARRAY: ", ENCRYPTED-ARRAY.
   GOBACK.
   END PROGRAM TEA-ENCRYPT.
